#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main3(void) {
    // 1. Формы записи литералов
    int dec = 10;
    int oct = 010;   // Начинается с 0 — это 8-ичная система (8 в 10-ичной)
    int hex = 0x10;  // Начинается с 0x — это 16-ичная система (16 в 10-ичной)

    printf("DEC 10: %d\n", dec);
    printf("OCT 10: %d\n", oct);
    printf("HEX 10: %d\n", hex);

    // 2. Размеры литералов
    printf("INT SUFFIX: %d %d %d %d\n",
        (int)sizeof(10), (int)sizeof(10u), (int)sizeof(10LL), (int)sizeof(10ULL));

    printf("SUFFIX FLOAT: %d %d %d\n",
        (int)sizeof(0.1f), (int)sizeof(0.1), (int)sizeof(0.1L));

    // 3. Сравнение float и double
    printf("EQ: %d\n", 0.1f == 0.1);

    // 4. Символы и строки
    char ch = 'A';
    printf("CHAR FORMS: %d %d %d\n", 'A', '\x41', '\101');
    printf("LIT VAR STR: %d %d %d\n", (int)sizeof('A'), (int)sizeof(ch), (int)sizeof("A"));

    return 0;

    /*
    Системы счисления : Обычные цифры — 10 - ичная; с ведущим нулем 0 — 8 - ичная; с префиксом 0x — 16 - ичная.

    • Суффиксы: u/U задают беззнаковый тип (unsigned int), LL — long long, f/F — float (вместо дефолтного double).

    • Почему 0.1f != 0.1: Дробь 0.1 в двоичной системе является бесконечной периодической дробью. Тип double (0.1) 
    точнее и хранит больше знаков, чем float (0.1f). При сравнении float расширяется до double, но потерянные из-за 
    меньшей точности разряды заполняются нулями, из-за чего числа становятся не равны.

    • Размеры символов: В языке Си одиночный символьный литерал (например, 'A') имеет тип int, поэтому sizeof('A')
    равен 4. Однако переменная типа char оптимизирована под хранение одного байта, поэтому sizeof(ch) равен 1. Строкa
    "A" состоит из символа 'A' и терминального нуля \0, поэтому её размер — 2 байта.
    */

}
